```
debabrat@turbotindias-MacBook-Pro /users/debabrat/v5/omerotdk/tdk/baselines/getting_started/aws/aws_check_logging (baseline-refactor-aws-check-loggingin) $ terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: default


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.aws_alb_access_logging[0] will be created
  + resource "turbot_policy_setting" "aws_alb_access_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/applicationLoadBalancerAccessLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_cloudtrail_trail_encryption_at_rest[0] will be created
  + resource "turbot_policy_setting" "aws_cloudtrail_trail_encryption_at_rest" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-cloudtrail#/policy/types/trailEncryptionAtRest"
      + value                        = "Check: Customer managed key"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_cloudtrail_trail_log_validation[0] will be created
  + resource "turbot_policy_setting" "aws_cloudtrail_trail_log_validation" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-cloudtrail#/policy/types/trailLogFileValidation"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_cloudtrail_trail_status[0] will be created
  + resource "turbot_policy_setting" "aws_cloudtrail_trail_status" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-cloudtrail#/policy/types/trailStatus"
      + value                        = "Check: No delivery errors"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_elb_access_logging[0] will be created
  + resource "turbot_policy_setting" "aws_elb_access_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/classicLoadBalancerAccessLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_nlb_access_logging[0] will be created
  + resource "turbot_policy_setting" "aws_nlb_access_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/networkLoadBalancerAccessLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_redshift_cluster_access_logging[0] will be created
  + resource "turbot_policy_setting" "aws_redshift_cluster_access_logging" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-redshift#/policy/types/clusterAuditLogging"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_logging will be created
  + resource "turbot_smart_folder" "aws_logging" {
      + description = "Defines sets of policies for the AWS check logging baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Check Logging Policies"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + enable_alb_access_logging              = true
  + enable_cloudtrail_trail_encryption     = true
  + enable_cloudtrail_trail_log_validation = true
  + enable_cloudtrail_trail_status         = true
  + enable_elb_access_logging              = true
  + enable_nlb_access_logging              = true
  + enable_redshift_cluster_access_logging = true
  + enable_redshift_cluster_user_logging   = false
  + smart_folder_description               = "Defines sets of policies for the AWS check logging baseline"
  + smart_folder_name                      = "AWS Check Logging Policies"
  + smart_folder_parent_resource           = "tmod:@turbot/turbot#/"
  + turbot_profile                         = "default"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_logging: Creating...
turbot_smart_folder.aws_logging: Creation complete after 1s [id=215549688697879]
turbot_policy_setting.aws_nlb_access_logging[0]: Creating...
turbot_policy_setting.aws_cloudtrail_trail_status[0]: Creating...
turbot_policy_setting.aws_cloudtrail_trail_log_validation[0]: Creating...
turbot_policy_setting.aws_alb_access_logging[0]: Creating...
turbot_policy_setting.aws_redshift_cluster_access_logging[0]: Creating...
turbot_policy_setting.aws_cloudtrail_trail_encryption_at_rest[0]: Creating...
turbot_policy_setting.aws_elb_access_logging[0]: Creating...
turbot_policy_setting.aws_cloudtrail_trail_log_validation[0]: Creation complete after 3s [id=215549691371553]
turbot_policy_setting.aws_elb_access_logging[0]: Creation complete after 3s [id=215549691856947]
turbot_policy_setting.aws_redshift_cluster_access_logging[0]: Creation complete after 3s [id=215549691409442]
turbot_policy_setting.aws_cloudtrail_trail_status[0]: Creation complete after 3s [id=215549691717676]
turbot_policy_setting.aws_cloudtrail_trail_encryption_at_rest[0]: Creation complete after 3s [id=215549691708458]
turbot_policy_setting.aws_nlb_access_logging[0]: Creation complete after 3s [id=215549692311608]
turbot_policy_setting.aws_alb_access_logging[0]: Creation complete after 3s [id=215549692371004]

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.

Outputs:

enable_alb_access_logging = true
enable_cloudtrail_trail_encryption = true
enable_cloudtrail_trail_log_validation = true
enable_cloudtrail_trail_status = true
enable_elb_access_logging = true
enable_nlb_access_logging = true
enable_redshift_cluster_access_logging = true
enable_redshift_cluster_user_logging = false
smart_folder_description = "Defines sets of policies for the AWS check logging baseline"
smart_folder_name = "AWS Check Logging Policies"
smart_folder_parent_resource = "tmod:@turbot/turbot#/"
turbot_profile = "default"
```